In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
import plotly.express as px
from sklearn.linear_model import LinearRegression
from sklearn.cluster import KMeans
from sklearn.ensemble import RandomForestRegressor
import statsmodels.api as sm
from sklearn.model_selection import train_test_split
from sklearn.metrics import root_mean_squared_error, r2_score

In [2]:
df = pd.read_csv('linear_reg.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2498 entries, 0 to 2497
Data columns (total 5 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   interest_rate               2498 non-null   float64
 1   fico_range                  2498 non-null   object
 2   amount_requested            2498 non-null   float64
 3   amount_funded_by_investors  2498 non-null   float64
 4   loan_length                 2498 non-null   float64
dtypes: float64(4), object(1)
memory usage: 97.7+ KB

In [5]:
df.sample()

,interest_rate,fico_range,amount_requested,amount_funded_by_investors,loan_length
1208,12.69,735-739,20000.0,20000.0,60.0

In [6]:
df.describe()

,interest_rate,amount_requested,amount_funded_by_investors,loan_length
count,2498.000000,2498.000000,2498.000000,2498.000000
mean,13.070368,12413.030424,12009.280661,41.265012
std,4.178007,7801.222483,7743.387861,9.933753
min,5.420000,1000.000000,-0.010000,36.000000
25%,10.160000,6000.000000,6000.000000,36.000000
50%,13.110000,10000.000000,10000.000000,36.000000
75%,15.800000,17000.000000,16000.000000,36.000000
max,24.890000,35000.000000,35000.000000,60.000000

In [8]:
df[df['amount_funded_by_investors']<0]

,interest_rate,fico_range,amount_requested,amount_funded_by_investors,loan_length
400,12.29,685-689,7500.0,-0.01,36.0
1630,13.87,640-644,2200.0,-0.01,36.0

In [9]:
df[df['loan_length']==36]

,interest_rate,fico_range,amount_requested,amount_funded_by_investors,loan_length
0,8.90,735-739,20000.0,20000.00,36.0
1,12.12,715-719,19200.0,19200.00,36.0
3,9.99,695-699,10000.0,9975.00,36.0
4,11.71,695-699,12000.0,12000.00,36.0
5,15.31,670-674,6000.0,6000.00,36.0
...,...,...,...,...,...
2490,10.08,710-714,6400.0,6350.00,36.0
2492,14.65,685-689,24000.0,23975.00,36.0
2495,13.99,680-684,10000.0,10000.00,36.0
2496,12.42,675-679,6000.0,6000.00,36.0
2497,13.79,670-674,9000.0,5242.75,36.0